load_testing/results_for_report/long_comp/cons_hash_3_peaks_360s_10keys_400r.txt
wrk -t2 --timeout 15s --latency -s longCompScript.lua -c200 -d360s -R400 http://172.31.11.13:3000
CONNECTED to addr       172.31.11.13:3000
CONNECTED to addr       172.31.10.136:3000
all addrs:
1       172.31.11.13:3000
2       172.31.10.136:3000
thread addr: 172.31.11.13:3000
all addrs:
1       172.31.11.13:3000
2       172.31.10.136:3000
thread addr: 172.31.10.136:3000
Running 6m test @ http://172.31.11.13:3000
  2 threads and 200 connections
  Thread calibration: mean lat.: 4.175ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.045ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.47ms   17.48ms 687.10ms   98.70%
    Req/Sec   210.89     61.00   777.00     73.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.89ms
 75.000%    4.70ms
 90.000%    5.57ms
 99.000%   31.89ms
 99.900%  262.65ms
 99.990%  656.38ms
 99.999%  678.91ms
100.000%  687.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.511     0.000000            1         1.00
       3.121     0.100000        14023         1.11
       3.331     0.200000        27981         1.25
       3.523     0.300000        42034         1.43
       3.707     0.400000        56038         1.67
       3.895     0.500000        69948         2.00
       4.003     0.550000        76946         2.22
       4.135     0.600000        83926         2.50
       4.295     0.650000        90879         2.86
       4.491     0.700000        97956         3.33
       4.699     0.750000       104988         4.00
       4.803     0.775000       108414         4.44
       4.915     0.800000       111883         5.00
       5.035     0.825000       115392         5.71
       5.171     0.850000       118862         6.67
       5.339     0.875000       122346         8.00
       5.443     0.887500       124119         8.89
       5.567     0.900000       125822        10.00
       5.747     0.912500       127578        11.43
       6.035     0.925000       129318        13.33
       6.651     0.937500       131064        16.00
       7.107     0.943750       131945        17.78
       7.687     0.950000       132813        20.00
       8.351     0.956250       133696        22.86
       9.135     0.962500       134561        26.67
      10.247     0.968750       135431        32.00
      10.999     0.971875       135871        35.56
      12.079     0.975000       136305        40.00
      13.391     0.978125       136742        45.71
      15.527     0.981250       137181        53.33
      18.655     0.984375       137617        64.00
      21.119     0.985938       137836        71.11
      23.983     0.987500       138052        80.00
      28.591     0.989062       138270        91.43
      34.527     0.990625       138489       106.67
      41.823     0.992188       138707       128.00
      45.855     0.992969       138817       142.22
      51.167     0.993750       138926       160.00
      58.111     0.994531       139035       182.86
      65.119     0.995313       139144       213.33
      73.535     0.996094       139253       256.00
      79.935     0.996484       139308       284.44
      88.319     0.996875       139363       320.00
      98.111     0.997266       139418       365.71
     110.783     0.997656       139472       426.67
     126.719     0.998047       139526       512.00
     134.015     0.998242       139555       568.89
     150.015     0.998437       139581       640.00
     174.335     0.998633       139608       731.43
     198.911     0.998828       139636       853.33
     272.639     0.999023       139663      1024.00
     317.695     0.999121       139677      1137.78
     342.015     0.999219       139690      1280.00
     393.983     0.999316       139704      1462.86
     436.479     0.999414       139718      1706.67
     510.719     0.999512       139731      2048.00
     518.911     0.999561       139738      2275.56
     528.383     0.999609       139745      2560.00
     545.791     0.999658       139752      2925.71
     584.703     0.999707       139759      3413.33
     622.079     0.999756       139766      4096.00
     627.711     0.999780       139769      4551.11
     636.415     0.999805       139772      5120.00
     644.607     0.999829       139776      5851.43
     646.143     0.999854       139780      6826.67
     648.191     0.999878       139782      8192.00
     655.359     0.999890       139784      9102.22
     657.407     0.999902       139786     10240.00
     658.943     0.999915       139788     11702.86
     659.455     0.999927       139789     13653.33
     663.039     0.999939       139791     16384.00
     664.575     0.999945       139792     18204.44
     666.111     0.999951       139793     20480.00
     669.695     0.999957       139794     23405.71
     669.695     0.999963       139794     27306.67
     674.303     0.999969       139795     32768.00
     676.351     0.999973       139796     36408.89
     676.351     0.999976       139796     40960.00
     676.863     0.999979       139797     46811.43
     676.863     0.999982       139797     54613.33
     676.863     0.999985       139797     65536.00
     678.911     0.999986       139798     72817.78
     678.911     0.999988       139798     81920.00
     678.911     0.999989       139798     93622.86
     678.911     0.999991       139798    109226.67
     678.911     0.999992       139798    131072.00
     687.615     0.999993       139799    145635.56
     687.615     1.000000       139799          inf
#[Mean    =        5.469, StdDeviation   =       17.483]
#[Max     =      687.104, Total count    =       139799]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  144001 requests in 6.00m, 35.16MB read
Requests/sec:    400.00
Transfer/sec:    100.00KB
thread 0 made 72001 requests and got 72000 responses
thread 1 made 72001 requests and got 72001 responses
2022-06-07 02:58:24.685 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: NaN 
2022-06-07 02:58:29.693 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8466019417475728 
2022-06-07 02:58:34.690 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9097744360902256 
2022-06-07 02:58:39.696 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.875 
2022-06-07 02:58:44.694 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8403614457831325 
2022-06-07 02:58:49.695 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9589384076114171 
2022-06-07 02:58:54.699 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8883324987481223 
2022-06-07 02:58:59.698 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9114114114114114 
2022-06-07 02:59:04.701 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8483483483483483 
2022-06-07 02:59:09.705 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8823234852278419 
2022-06-07 02:59:14.704 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9444444444444444 
2022-06-07 02:59:19.711 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8573573573573574 
2022-06-07 02:59:24.708 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8892785571142283 
2022-06-07 02:59:29.713 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9269634817408703 
2022-06-07 02:59:34.715 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9178356713426852 
2022-06-07 02:59:39.713 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.7222222222222223 
2022-06-07 02:59:44.722 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8933933933933933 
2022-06-07 02:59:49.715 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9964894684052157 
2022-06-07 02:59:54.718 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9359679839919959 
2022-06-07 02:59:59.719 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9292168674698795 
2022-06-07 03:00:04.728 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.868803204807211 
2022-06-07 03:00:09.734 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.847194388777555 
2022-06-07 03:00:14.727 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.870110330992979 
2022-06-07 03:00:19.728 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.942942942942943 
2022-06-07 03:00:24.732 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9449724862431215 
2022-06-07 03:00:29.736 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9414414414414414 
2022-06-07 03:00:34.739 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.897897897897898 
2022-06-07 03:00:39.744 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9924924924924925 
2022-06-07 03:00:44.744 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.093093093093093 
2022-06-07 03:00:49.744 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1126126126126126 
2022-06-07 03:00:54.745 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1171171171171173 
2022-06-07 03:00:59.748 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0325 
2022-06-07 03:01:04.752 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0765765765765765 
2022-06-07 03:01:09.754 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1381381381381384 
2022-06-07 03:01:14.757 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0385578367551327 
2022-06-07 03:01:19.758 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0945945945945947 
2022-06-07 03:01:24.771 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1308691308691308 
2022-06-07 03:01:29.763 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0325977933801407 
2022-06-07 03:01:34.767 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.112 
2022-06-07 03:01:39.772 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0185092546273133 
2022-06-07 03:01:44.774 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.099099099099099 
2022-06-07 03:01:49.775 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.981981981981982 
2022-06-07 03:01:54.780 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0245122561280637 
2022-06-07 03:01:59.779 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.104208416833667 
2022-06-07 03:02:04.782 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0646616541353384 
2022-06-07 03:02:09.783 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.099699398797595 
2022-06-07 03:02:14.782 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.018018018018018 
2022-06-07 03:02:19.787 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1381381381381384 
2022-06-07 03:02:24.792 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0615615615615615 
2022-06-07 03:02:29.789 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1192384769539077 
2022-06-07 03:02:34.793 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.150575287643822 
2022-06-07 03:02:39.795 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.078078078078078 
2022-06-07 03:02:44.804 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.16191904047976 
2022-06-07 03:02:49.798 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0440881763527052 
2022-06-07 03:02:54.806 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.994 
2022-06-07 03:02:59.803 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:04.804 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:09.809 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:14.812 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:19.810 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:24.813 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:29.815 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:34.819 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:39.820 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:44.824 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:49.825 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:54.827 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:03:59.833 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:04:04.831 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:04:09.843 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:04:14.840 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:04:19.838 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:04:24.840 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:04:29.841 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 3 
2022-06-07 03:04:34.843 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: NaN